# 1. Задайте список, состоящий из произвольных чисел, количество задаёт пользователь.
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётных позициях(не индексах).
# in
# 5
#
# out
# [10, 2, 3, 8, 9]
# 22
#
# in
# 4
#
# out
# [4, 2, 4, 9]
# 8

# import random
# def rand(number):
#    list = []
#    for i in range (number):
#        list.append(random.randint(0, 100))
#    return list
# total_list = rand(int(input('Введите количество элементов списка ')))
# print(total_list, sum(total_list[::2]))


# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# in
# 4
#
# out
# [2, 5, 8, 10]
# [20, 40]
#
# in
# 5
#
# out
# [2, 2, 4, 8, 8]
# [16, 16, 4]

# 

# 3. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Без использования встроенной функции преобразования, без строк.Без использования встроенной функции
# преобразования, без строк.
# in
# 88
# out
# 1011000
#
# in
# 11
# out
# 1011

# def to_binar(num):
#     temp = []
#     while num > 0:
#         temp.insert(0, num % 2)
#         num //= 2
#     print(*temp, sep='')
#     return temp

# to_binar(int(input('Введите число:'))) 


